---
kind: other
id: Properties.T:Autodesk.Revit.DB.ConnectionValidationInfo
source: html/815bb295-15ae-b3c2-e6fd-ef22c35b35fc.htm
---
# ConnectionValidationInfo Properties

Specifies whether the .NET object represents a valid Revit entity.